#include "MotorControl.H" 

typedef unsigned int	WORD;
typedef unsigned char	BYTE ;

/***********************************************************
功能： 电机正转模式
入口：
出口：
说明： 启动水泵浇水
************************************************************/
void Forward()  //反转
{
	A=1;
	C=0;	
}

/***********************************************************
功能： 电机停止模式
入口：
出口：
说明： 停止水泵
************************************************************/
void MotorStop()
{
	A=0;
	C=0;	
}

/***********************************************************
功能： PWM初始化
入口：
出口：
说明： 输出水流量控制
	   PWM0=(256-CCAP0H)/256
************************************************************/
void PWM_Init()	  //PWM初始化
{
	ACC   =   P_SW1;
    ACC   &=   ~(CCP_S0 | CCP_S1);    //CCP_S0=1 CCP_S1=0
    ACC   |=   CCP_S0;                //(P3.4/ECI_2, P3.5/CCP0_2, P3.6/CCP1_2, P3.7/CCP2_2)
    P_SW1   =   ACC;  
	               
    CCON=0;
	CL=0;
	CH=0;
	CMOD=0X02;
	PCA_PWM0  =0x00;                  //PCA模块0工作于8位PWM
    CCAP0H    =CCAP0L=0x80;           //PWM0的占空比为87.5% ((100H-20H)/100H)
    CCAPM0    =0x42;       			  //PCA模块0为8位PWM模式
    CR = 1;                           //PCA定时器开始工作
}


















